app/views/books/_form.html.erb

      <%= form.label :genero_id, "Gênero Literário" %>
      <%= form.collection_select :genero_id, Genero.all, :id, :nome, prompt: "Selecione" %>
---
SELECT "generos".* FROM "generos"