app/views/books/index.html.erb

SELECT "generos".* FROM "generos"
---

        <% if book.genero.present? %>