app/controllers/books_controller.rb

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "updated_at" = $1 WHERE "books"."id" = $2  [["updated_at", "2025-11-20 02:54:22.657391"], ["id", 3]]