app/controllers/books_controller.rb

  def index
    @generos = Genero.all

    @books = Book.all
---
SELECT "generos".* FROM "generos"
SELECT "books".* FROM "books" WHERE (title ILIKE $1 OR author ILIKE $2)  [[nil, "%O pequeno Principe%"], [nil, "%O pequeno Principe%"]]

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "author", "created_at", "updated_at", "paginas", "status", "nota", "resenha", "edicao", "editora", "pais_autor") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def update
  respond_to do |format|
    if @book.update(book_params)
---
UPDATE "books" SET "updated_at" = $1, "status" = $2, "resenha" = $3, "edicao" = $4, "editora" = $5, "pais_autor" = $6 WHERE "books"."id" = $7  [["updated_at", "2025-11-26 02:50:17.876299"], ["status", ""], ["resenha", ""], ["edicao", ""], ["editora", "Agir"], ["pais_autor", ""], ["id", 3]]

  def destroy
    @book.destroy!
---
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 1]]