app/controllers/generos_controller.rb

SELECT "generos".* FROM "generos"
---
  def index
    @generos = Genero.all

INSERT INTO "generos" ("nome", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["nome", "Fábula"], ["created_at", "2025-11-26 02:57:23.791396"], ["updated_at", "2025-11-26 02:57:23.791396"]]
---
  def create
    @genero = Genero.new(genero_params)

    if @genero.save